In [1]:
import pandas as pd
import numpy as np

In [2]:
file_path = r"C:\Users\HARSHITHA\Downloads\price_paid_records.csv.zip"

# Read CSV directly from ZIP
df = pd.read_csv(file_path, compression='zip')

# Look at top rows
df.head()

,Transaction unique identifier,Price,Date of Transfer,Property Type,Old/New,Duration,Town/City,District,County,PPDCategory Type,Record Status - monthly file only
0,{81B82214-7FBC-4129-9F6B-4956B4A663AD},25000,1995-08-18 00:00,T,N,F,OLDHAM,OLDHAM,GREATER MANCHESTER,A,A
1,{8046EC72-1466-42D6-A753-4956BF7CD8A2},42500,1995-08-09 00:00,S,N,F,GRAYS,THURROCK,THURROCK,A,A
2,{278D581A-5BF3-4FCE-AF62-4956D87691E6},45000,1995-06-30 00:00,T,N,F,HIGHBRIDGE,SEDGEMOOR,SOMERSET,A,A
3,{1D861C06-A416-4865-973C-4956DB12CD12},43150,1995-11-24 00:00,T,N,F,BEDFORD,NORTH BEDFORDSHIRE,BEDFORDSHIRE,A,A
4,{DD8645FD-A815-43A6-A7BA-4956E58F1874},18899,1995-06-23 00:00,S,N,F,WAKEFIELD,LEEDS,WEST YORKSHIRE,A,A

In [3]:
# Show summary info of dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22489348 entries, 0 to 22489347
Data columns (total 11 columns):
 #   Column                             Dtype
---  ------                             -----
 0   Transaction unique identifier      object
 1   Price                              int64
 2   Date of Transfer                   object
 3   Property Type                      object
 4   Old/New                            object
 5   Duration                           object
 6   Town/City                          object
 7   District                           object
 8   County                             object
 9   PPDCategory Type                   object
 10  Record Status - monthly file only  object
dtypes: int64(1), object(10)
memory usage: 1.8+ GB

In [4]:
# Show shape (rows & columns)
df.shape

(22489348, 11)

In [6]:
df = df.set_index("Transaction unique identifier")
df.head()

,Price,Date of Transfer,Property Type,Old/New,Duration,Town/City,District,County,PPDCategory Type,Record Status - monthly file only
Transaction unique identifier,,,,,,,,,,
{81B82214-7FBC-4129-9F6B-4956B4A663AD},25000,1995-08-18 00:00,T,N,F,OLDHAM,OLDHAM,GREATER MANCHESTER,A,A
{8046EC72-1466-42D6-A753-4956BF7CD8A2},42500,1995-08-09 00:00,S,N,F,GRAYS,THURROCK,THURROCK,A,A
{278D581A-5BF3-4FCE-AF62-4956D87691E6},45000,1995-06-30 00:00,T,N,F,HIGHBRIDGE,SEDGEMOOR,SOMERSET,A,A
{1D861C06-A416-4865-973C-4956DB12CD12},43150,1995-11-24 00:00,T,N,F,BEDFORD,NORTH BEDFORDSHIRE,BEDFORDSHIRE,A,A
{DD8645FD-A815-43A6-A7BA-4956E58F1874},18899,1995-06-23 00:00,S,N,F,WAKEFIELD,LEEDS,WEST YORKSHIRE,A,A

In [8]:
df.columns = df.columns.str.strip()

In [9]:
df.columns

Index(['Price', 'Date of Transfer', 'Property Type', 'Old/New', 'Duration',
       'Town/City', 'District', 'County', 'PPDCategory Type',
       'Record Status - monthly file only'],
      dtype='object')

In [10]:
df = df[[
    "Price",
    "Date of Transfer",
    "Property Type",
    "Old/New",
    "Duration",
    "Town/City",
    "District",
    "County",
    "PPDCategory Type"
]]

df.head()

,Price,Date of Transfer,Property Type,Old/New,Duration,Town/City,District,County,PPDCategory Type
Transaction unique identifier,,,,,,,,,
{81B82214-7FBC-4129-9F6B-4956B4A663AD},25000,1995-08-18 00:00,T,N,F,OLDHAM,OLDHAM,GREATER MANCHESTER,A
{8046EC72-1466-42D6-A753-4956BF7CD8A2},42500,1995-08-09 00:00,S,N,F,GRAYS,THURROCK,THURROCK,A
{278D581A-5BF3-4FCE-AF62-4956D87691E6},45000,1995-06-30 00:00,T,N,F,HIGHBRIDGE,SEDGEMOOR,SOMERSET,A
{1D861C06-A416-4865-973C-4956DB12CD12},43150,1995-11-24 00:00,T,N,F,BEDFORD,NORTH BEDFORDSHIRE,BEDFORDSHIRE,A
{DD8645FD-A815-43A6-A7BA-4956E58F1874},18899,1995-06-23 00:00,S,N,F,WAKEFIELD,LEEDS,WEST YORKSHIRE,A

In [11]:
df.isnull().sum()

Price               0
Date of Transfer    0
Property Type       0
Old/New             0
Duration            0
Town/City           0
District            0
County              0
PPDCategory Type    0
dtype: int64

In [12]:
df["Date of Transfer"] = pd.to_datetime(df["Date of Transfer"])
df.dtypes

C:\Users\HARSHITHA\AppData\Local\Temp\ipykernel_9860\696628176.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Date of Transfer"] = pd.to_datetime(df["Date of Transfer"])

Price                        int64
Date of Transfer    datetime64[ns]
Property Type               object
Old/New                     object
Duration                    object
Town/City                   object
District                    object
County                      object
PPDCategory Type            object
dtype: object

In [13]:
df = df.set_index("Date of Transfer")
df.head()

,Price,Property Type,Old/New,Duration,Town/City,District,County,PPDCategory Type
Date of Transfer,,,,,,,,
1995-08-18,25000,T,N,F,OLDHAM,OLDHAM,GREATER MANCHESTER,A
1995-08-09,42500,S,N,F,GRAYS,THURROCK,THURROCK,A
1995-06-30,45000,T,N,F,HIGHBRIDGE,SEDGEMOOR,SOMERSET,A
1995-11-24,43150,T,N,F,BEDFORD,NORTH BEDFORDSHIRE,BEDFORDSHIRE,A
1995-06-23,18899,S,N,F,WAKEFIELD,LEEDS,WEST YORKSHIRE,A

In [14]:
df_small = df[[
    "Price",
    "Property Type",
    "Old/New",
    "Duration",
    "Town/City",
    "County",
    "PPDCategory Type"
]]
df_small.head()

,Price,Property Type,Old/New,Duration,Town/City,County,PPDCategory Type
Date of Transfer,,,,,,,
1995-08-18,25000,T,N,F,OLDHAM,GREATER MANCHESTER,A
1995-08-09,42500,S,N,F,GRAYS,THURROCK,A
1995-06-30,45000,T,N,F,HIGHBRIDGE,SOMERSET,A
1995-11-24,43150,T,N,F,BEDFORD,BEDFORDSHIRE,A
1995-06-23,18899,S,N,F,WAKEFIELD,WEST YORKSHIRE,A

In [15]:
df_small["Price"].head()

Date of Transfer
1995-08-18    25000
1995-08-09    42500
1995-06-30    45000
1995-11-24    43150
1995-06-23    18899
Name: Price, dtype: int64

In [16]:
df_2020 = df_small.loc["2020"]
df_2020.head()

Empty DataFrame
Columns: [Price, Property Type, Old/New, Duration, Town/City, County, PPDCategory Type]
Index: []

In [17]:
df_small["Price_K"] = df_small["Price"] / 1000
df_small.head()

,Price,Property Type,Old/New,Duration,Town/City,County,PPDCategory Type,Price_K
Date of Transfer,,,,,,,,
1995-08-18,25000,T,N,F,OLDHAM,GREATER MANCHESTER,A,25.000
1995-08-09,42500,S,N,F,GRAYS,THURROCK,A,42.500
1995-06-30,45000,T,N,F,HIGHBRIDGE,SOMERSET,A,45.000
1995-11-24,43150,T,N,F,BEDFORD,BEDFORDSHIRE,A,43.150
1995-06-23,18899,S,N,F,WAKEFIELD,WEST YORKSHIRE,A,18.899

In [18]:
df_expensive = df_small[df_small["Price"] > 500000]
df_expensive.head()

,Price,Property Type,Old/New,Duration,Town/City,County,PPDCategory Type,Price_K
Date of Transfer,,,,,,,,
1995-10-20,1375000,D,N,F,LONDON,GREATER LONDON,A,1375.0
1995-11-10,900000,F,N,L,LONDON,GREATER LONDON,A,900.0
1995-06-29,693000,F,Y,L,LONDON,GREATER LONDON,A,693.0
1995-06-27,600000,D,N,L,LONDON,GREATER LONDON,A,600.0
1995-03-20,600000,D,N,F,BANBURY,OXFORDSHIRE,A,600.0

In [19]:
detached_london = df_small[
  (df_small["Property Type"] == "D") &
  (df_small["Town/City"] == "LONDON")
]
detached_london.head()

,Price,Property Type,Old/New,Duration,Town/City,County,PPDCategory Type,Price_K
Date of Transfer,,,,,,,,
1995-06-08,156000,D,N,F,LONDON,GREATER LONDON,A,156.0
1995-08-08,280000,D,N,F,LONDON,GREATER LONDON,A,280.0
1995-11-20,200500,D,N,F,LONDON,GREATER LONDON,A,200.5
1995-01-03,110000,D,N,F,LONDON,GREATER LONDON,A,110.0
1995-10-20,1375000,D,N,F,LONDON,GREATER LONDON,A,1375.0

In [20]:
df_sorted = df_small.sort_values(by="Price", ascending=False)
df_sorted.head()

,Price,Property Type,Old/New,Duration,Town/City,County,PPDCategory Type,Price_K
Date of Transfer,,,,,,,,
2016-11-24,98900000,O,N,F,LONDON,GREATER LONDON,B,98900.000
2017-02-09,98765391,O,N,L,BIRMINGHAM,WEST MIDLANDS,B,98765.391
2017-04-06,98446300,O,N,F,LONDON,GREATER LONDON,B,98446.300
2015-10-21,98250000,O,N,F,READING,WOKINGHAM,B,98250.000
2017-05-25,97630000,O,N,L,LONDON,GREATER LONDON,B,97630.000

In [21]:
avg_by_type = df_small.groupby("Property Type")["Price"].mean()
avg_by_type

Property Type
D    2.500975e+05
F    1.749829e+05
O    1.295774e+06
S    1.489675e+05
T    1.365340e+05
Name: Price, dtype: float64

In [23]:
df_small.columns

Index(['Price', 'Property Type', 'Old/New', 'Duration', 'Town/City', 'County',
       'PPDCategory Type', 'Price_K'],
      dtype='object')

In [25]:
df_reset = df_small.reset_index()
df_reset.head()

,Date of Transfer,Price,Property Type,Old/New,Duration,Town/City,County,PPDCategory Type,Price_K
0,1995-08-18,25000,T,N,F,OLDHAM,GREATER MANCHESTER,A,25.000
1,1995-08-09,42500,S,N,F,GRAYS,THURROCK,A,42.500
2,1995-06-30,45000,T,N,F,HIGHBRIDGE,SOMERSET,A,45.000
3,1995-11-24,43150,T,N,F,BEDFORD,BEDFORDSHIRE,A,43.150
4,1995-06-23,18899,S,N,F,WAKEFIELD,WEST YORKSHIRE,A,18.899

In [26]:
df_small.iloc[0:5]

,Price,Property Type,Old/New,Duration,Town/City,County,PPDCategory Type,Price_K
Date of Transfer,,,,,,,,
1995-08-18,25000,T,N,F,OLDHAM,GREATER MANCHESTER,A,25.000
1995-08-09,42500,S,N,F,GRAYS,THURROCK,A,42.500
1995-06-30,45000,T,N,F,HIGHBRIDGE,SOMERSET,A,45.000
1995-11-24,43150,T,N,F,BEDFORD,BEDFORDSHIRE,A,43.150
1995-06-23,18899,S,N,F,WAKEFIELD,WEST YORKSHIRE,A,18.899

In [27]:
df_small.iloc[0:5, 0:3]

                  Price Property Type Old/New
Date of Transfer
1995-08-18        25000             T       N
1995-08-09        42500             S       N
1995-06-30        45000             T       N
1995-11-24        43150             T       N
1995-06-23        18899             S       N